controllers/CategoryController.php

SELECT * FROM `category` WHERE `id`='3'
---
    protected function findModel($id)
    {
        if (($model = Category::findOne($id)) !== null) {